Revit 2026 API

# ExporterIFCPushExportState Method

---

Sets the internal state of the exporter to process the geometry and properties of the input element.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void PushExportState(
	Element Elem,
	GeometryElement GRep
)
```
```vb
Public Sub PushExportState (
	Elem As Element,
	GRep As GeometryElement
)
```
```cpp
public:
void PushExportState(
	Element^ Elem,
	GeometryElement^ GRep
)
```
```fsharp
member PushExportState :
        Elem : Element *
        GRep : GeometryElement -> unit
```

#### Parameters

Elem Element
     The element.
GRep GeometryElement
     The geometry of the element. Optional, can be .

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The element will be assigned until PopExportState() is called.

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace